{
  "projects": [
    {
      "title": "Cv maker",
      "image": "/pictures/cvmaker.jpg",
      "description": "Cv maker app that I made using NextJS with tailwind and shadcn for the frontend. The Backend is made with spring boot and postgresql as the database. The app allows you to create  and update cver which you can download as pdf.As of now, you can only download one type of cv format, but plan to add more later. Backend might be slow since the hosting for it is free... feel free to try it out. The code for the project can be shown on request",
      "githubLink": "NONE",
      "liveDemoLink": "https://cv-maker-three-fawn.vercel.app/"
    },
    {
      "title": "Sudoku",
      "image": "/pictures/sudoku.jpg",
      "description": "A Sudoku app made with React Native to learn more react and native. This is a project in IDATT2506-Application-development-for-mobile-devices. It offers 3 different difficulties and a storage to load and save games. Check out the github repo for more information.",
      "githubLink": "https://github.com/Jonabarce/IDATT2506-Application-development-for-mobile-devices/tree/main/Project/sudoku",
      "liveDemoLink": "NONE"
    },
    {
      "title": "WeatherWatt",
      "image": "/pictures/weatherwatt.jpg",
      "description": "A personal Nuxt project offering global weather updates from the Meteorological Institute and electricity prices for Norway via Beneficial Apps. Get real-time weather and power pricing without leaving the site.",
      "githubLink": "https://github.com/Jonabarce/WeatherWatt/tree/main",
      "liveDemoLink": "https://weather-watt.vercel.app/"
    },
    {
      "title": "COMMERCEBAY",
      "image": "/pictures/finn.jpg",
      "description": "This is a school project, where i was in a team of 4 people that had 1 week to make a copy of finn.no/ebay.com. It was made using Vue.js and Spring boot with MySQL as the database. I mainly worked on the frontend but i also helped out fixing the security part for backend. Live demo will available soon.",
      "githubLink": "https://github.com/Jonabarce/IDATT2105-Full-stack-application-development-project",
      "liveDemoLink": "NONE"
    },
    {
      "title": "Smartmat",
      "image": "/pictures/smartmat.jpg",
      "description": "I collaborated with a team of 7 on a school project to create a system using the scrum method aimed at reducing household food waste. The product, although not perfect, exceeded our vision document's expectations, allowing users to group by household, manage a digital fridge of groceries, and auto-generate weekly menus from its contents using Nuxt 3, Spring Boot, and MySQL. While I mainly focused on the frontend, I also assisted with backend tasks. Source code and live demo coming soon.",
      "githubLink": "NONE",
      "liveDemoLink": "NONE"
    },
    {
      "title": "Tournament Creater App",
      "image": "/pictures/tournament.jpg",
      "description": "This project is a school projects. It was part of the subject 'System development - IDATT1002'.The tournament creater app is an app made to help structure and make e-sport tournaments. This app was made with a group of 6 people. Check out the gitlab link for more information",
      "githubLink": "https://github.com/Jonabarce/IDATT1002",
      "liveDemoLink": "NONE"
    }
  ]
}
